# Este es la libreta del dia1

In [1]:
#del 10 de septiembre

In [2]:
ls

Dia1.ipynb  PLF/  sales.csv

In [3]:
import pandas as pd

In [4]:
df=pd.read_csv('sales.csv',index_col='month')

In [5]:
df

         huevos   sal  jamon
month
Enero        47  12.0   17.0
Febrero     110  50.0   31.0
Marzo       221  89.0   72.0
Abril        77  87.0   20.0
Mayo        132   NaN   52.0
Junio       205  60.0   55.0

In [6]:
df['sal']['Abril']

87.0

In [7]:
df.huevos['Marzo']

221

In [11]:
#semana 3

In [8]:
df.loc['Mayo']['jamon']

52.0

In [10]:
df.iloc[4][2]

52.0

In [13]:
df_new=df[['sal','huevos']]

In [14]:
df_new

          sal  huevos
month
Enero    12.0      47
Febrero  50.0     110
Marzo    89.0     221
Abril    87.0      77
Mayo      NaN     132
Junio    60.0     205